Revit 2027 API
MultiReferenceAnnotationOptions Properties
The MultiReferenceAnnotationOptions type exposes the following members.
Properties
Name | Description
DimensionLineDirection |  The direction vector of the dimension line.
DimensionLineOrigin |  The origin point for the dimension line.
DimensionPlaneNormal |  The normal vector to the dimension plane.
DimensionStyleType |  The dimension style type to be used by the new MultiReferenceAnnotation.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MultiReferenceAnnotationType |  The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
TagHasLeader |  When true the tag will be created with an attached leader. When false the tag will be created without a leader.
TagHeadPosition |  The position for the tag's head.
Top
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace